app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(
      first_name: params["first_name"],
      last_name: params["last_name"],
      email: params["email"],
      phone: params["phone"],
      job_title: params["job_title"],
      department_id: params["department_id"],
      password: params["password"],
      password_confirmation: params["password_confirmation"],
      admin: params["admin"],
    )
    if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "email", "phone", "job_title", "department_id", "created_at", "updated_at", "admin", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"